/** @file

;******************************************************************************
;* Copyright (c) 2014, Insyde Software Corp. All Rights Reserved.
;*
;* You may not reproduce, distribute, publish, display, perform, modify, adapt,
;* transmit, broadcast, present, recite, release, license or otherwise exploit
;* any part of this publication in any form, by any means, without the prior
;* written permission of Insyde Software Corporation.
;*
;******************************************************************************
*/

/=#

//
// Form 0x225: Lpss Scc configuration
//
#string STR_LPSS_DMA1_PROMPT                                #language en-US  "LPSS DMA #1 Support"
#string STR_LPSS_DMA1_HELP                                  #language en-US  ""
#string STR_LPSS_DMA2_PROMPT                                #language en-US  "LPSS DMA #2 Support"
#string STR_LPSS_DMA2_HELP                                  #language en-US  ""
#string STR_LPSS_I2C1_PROMPT                                #language en-US  "LPSS I2C #1 Support"
#string STR_LPSS_I2C1_HELP                                  #language en-US  ""
#string STR_LPSS_I2C2_PROMPT                                #language en-US  "LPSS I2C #2 Support"
#string STR_LPSS_I2C2_HELP                                  #language en-US  ""
#string STR_LPSS_I2C3_PROMPT                                #language en-US  "LPSS I2C #3 Support"
#string STR_LPSS_I2C3_HELP                                  #language en-US  ""
#string STR_LPSS_I2C4_PROMPT                                #language en-US  "LPSS I2C #4 Support"
#string STR_LPSS_I2C4_HELP                                  #language en-US  ""
#string STR_LPSS_I2C5_PROMPT                                #language en-US  "LPSS I2C #5 Support"
#string STR_LPSS_I2C5_HELP                                  #language en-US  ""
#string STR_LPSS_I2C6_PROMPT                                #language en-US  "LPSS I2C #6 Support"
#string STR_LPSS_I2C6_HELP                                  #language en-US  ""
#string STR_LPSS_I2C7_PROMPT                                #language en-US  "LPSS I2C #7 Support"
#string STR_LPSS_I2C7_HELP                                  #language en-US  ""
#string STR_LPSS_HSUART1_PROMPT                             #language en-US  "LPSS HSUART #1 Support"
#string STR_LPSS_HSUART1_HELP                               #language en-US  ""
#string STR_LPSS_HSUART2_PROMPT                             #language en-US  "LPSS HSUART #2 Support"
#string STR_LPSS_HSUART2_HELP                               #language en-US  ""
#string STR_PWM1_PROMPT                                     #language en-US  "LPSS PWM #1 Support"
#string STR_PWM1_HELP                                       #language en-US  ""
#string STR_PWM2_PROMPT                                     #language en-US  "LPSS PWM #2 Support"
#string STR_PWM2_HELP                                       #language en-US  ""
#string STR_LPSS_SPI0_PROMPT                                #language en-US "LPSS SPI #1 Support (D30:F5)"
#string STR_LPSS_SPI0_HELP                                  #language en-US "Enable/Disable LPSS SPI #1 Support"
#string STR_LPSS_SPI1_PROMPT                                #language en-US "LPSS SPI #2 Support (D30:F6)"
#string STR_LPSS_SPI1_HELP                                  #language en-US "Enable/Disable LPSS SPI #2 Support"
#string STR_LPSS_SPI2_PROMPT                                #language en-US "LPSS SPI #3 Support (D30:F7)"
#string STR_LPSS_SPI2_HELP                                  #language en-US "Enable/Disable LPSS SPI #3 Support"
#string STR_LPSS_SETTING_SUBTITLE                           #language en-US  "LPSS Configuration"
#string STR_LPSS_NFC_PROMPT                                 #language en-US  "NFC Selection"
#string STR_LPSS_NFC_HELP                                   #language en-US  "Auto will make selection based on BoardID"
#string STR_LPSS_NFC1                                       #language en-US  "NXP5441"
#string STR_LPSS_NFC2                                       #language en-US  "NXP5442"
#string STR_I2C_DEVICE_SETTING_SUBTITLE                     #language en-US  "I2C Devics Configuration"
#string STR_I2C_TOUCH_PROMPT                                #language en-US  "I2C Touch Devic Address"
#string STR_I2C_TOUCH_HELP                                  #language en-US  "I2C Touch Address Select:\n  RVP/iCDK(0x4B)\n  FFRD(0x4A)"
#string STR_I2C_FFRD                                        #language en-US  "0x4A"
#string STR_I2C_FVP                                         #language en-US  "0x4B"
#string STR_LPSS_SCC_FORM_TITLE                             #language en-US  "LPSS Configuration"
#string STR_LPSS_SCC_FORM_HELP                              #language en-US  ""
#string STR_LPSS_PCI_PROMPT                                 #language en-US  "LPSS Devices Mode"
#string STR_LPSS_PCI_HELP                                   #language en-US  ""
#string STR_MIPI_HSI_PROMPT                                 #language en-US  "MIPI HSI Support"
#string STR_MIPI_HSI_HELP                                   #language en-US  "Enable/Disable MIPI HSI Support \n Note: Official BIOS cannot support MIPI display directly even you select enable here. MIPI VBT is specific to different panel, user need replace VBT manually."
#string STR_LPSSDEVHIDE_PROMPT                         #language en-US "Unsupported LPSS Device"
#string STR_LPSSDEVHIDE_HELP                           #language en-US "Hide unsupported LPSS devices when in ACPI Mode"

#string STR_PCI_MODE_STRING                                 #language en-US "PCI Mode"
#string STR_ACPI_MODE_STRING                                #language en-US "ACPI Mode"
#string STR_NFC_DEVICE_SETTING_SUBTITLE                #language en-US  "Secure NFC Configuration"
#string STR_SECURE_NFC_PROMPT                          #language en-US  "Secure NFC"
#string STR_SECURE_NFC_HELP                            #language en-US  "Secure NFC - Enable/Disable"
